Revit 2024 API
BuiltInFailures.SketchFailures.BentFabricSheetLinesOverlapOrIntersect Property
 Segments in a bend profile cannot overlap, intersect, or be collinearly contiguous. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BentFabricSheetLinesOverlapOrIntersect { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricSheetLinesOverlapOrIntersect As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetLinesOverlapOrIntersect {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace